In [6]:
import mysql.connector as con

In [7]:
mydb=con.connect(host='localhost', user='root', password='r@shika123')

In [8]:
mydb

In [9]:
cursor=mydb.cursor()# its a pointer.

In [10]:
cursor.execute("use organisation")

# Q-1. Write an SQL query to print details of the Workers who have joined in Febâ€™2014.

In [6]:
cursor.execute("ALTER Table employee_email ADD Joining_Date date")

In [7]:
cursor.execute("UPDATE employee_email SET Joining_Date= '2014-02-02' where department_id in (1,10)")

In [12]:
cursor.execute("UPDATE employee_email SET Joining_Date= '2014-02-03' where department_id in (8,9,11,12,13,14)")

In [13]:
cursor.execute("UPDATE employee_email SET Joining_Date= '2014-02-04' where department_id in (15,16,17,18,19,20)")

In [14]:
# To insert a new record in employee_email table.
cursor.execute("insert into organisation.employee_email values(21,'Sanya@gmail.com','2022-03-05')")

In [15]:
import pandas as pd
pd.read_sql('select * from organisation.employee_email',mydb)

    Department_ID                  email_id Joining_Date
0               1   Rajdeep_Singh@gmail.com   2014-02-02
1               2       Raj_Singh@gmail.com   2014-02-02
2               3      deep_Singh@gmail.com   2014-02-02
3               5        Ritesh_D@gmail.com   2014-02-02
4               6            Renu@gmail.com   2014-02-02
5               7  Sonakshi_Singh@gmail.com   2014-02-02
6               8          Salini@gmail.com   2014-02-03
7               9         Natasha@gmail.com   2014-02-03
8              10        Minakshi@gmail.com   2014-02-02
9              11         Amitabh@gmail.com   2014-02-03
10             12       Rajdeep_S@gmail.com   2014-02-03
11             13    Sakshi_Singh@gmail.com   2014-02-03
12             14  Ranjana_Shetty@gmail.com   2014-02-03
13             15         Sejal_h@gmail.com   2014-02-04
14             16          satish@gmail.com   2014-02-04
15             17           vipul@gmail.com   2014-02-04
16              4       Rishabh_D@gmail.com   2014-02-02
17             18          Rakesh@gmail.com   2014-02-04
18             19          Mukesh@gmail.com   2014-02-04
19             20          Hannah@gmail.com   2014-02-04
20             21           Sanya@gmail.com   2022-03-05

In [16]:
mydb.commit()

In [17]:
cursor.execute("select* from employee_email where year(joining_date)=2014 and month(joining_date)=2")

In [18]:
cursor.fetchall()

[(1, 'Rajdeep_Singh@gmail.com', datetime.date(2014, 2, 2)),
 (2, 'Raj_Singh@gmail.com', datetime.date(2014, 2, 2)),
 (3, 'deep_Singh@gmail.com', datetime.date(2014, 2, 2)),
 (5, 'Ritesh_D@gmail.com', datetime.date(2014, 2, 2)),
 (6, 'Renu@gmail.com', datetime.date(2014, 2, 2)),
 (7, 'Sonakshi_Singh@gmail.com', datetime.date(2014, 2, 2)),
 (8, 'Salini@gmail.com', datetime.date(2014, 2, 3)),
 (9, 'Natasha@gmail.com', datetime.date(2014, 2, 3)),
 (10, 'Minakshi@gmail.com', datetime.date(2014, 2, 2)),
 (11, 'Amitabh@gmail.com', datetime.date(2014, 2, 3)),
 (12, 'Rajdeep_S@gmail.com', datetime.date(2014, 2, 3)),
 (13, 'Sakshi_Singh@gmail.com', datetime.date(2014, 2, 3)),
 (14, 'Ranjana_Shetty@gmail.com', datetime.date(2014, 2, 3)),
 (15, 'Sejal_h@gmail.com', datetime.date(2014, 2, 4)),
 (16, 'satish@gmail.com', datetime.date(2014, 2, 4)),
 (17, 'vipul@gmail.com', datetime.date(2014, 2, 4)),
 (4, 'Rishabh_D@gmail.com', datetime.date(2014, 2, 2)),
 (18, 'Rakesh@gmail.com', datetime.date(2014, 2, 4)),
 (19, 'Mukesh@gmail.com', datetime.date(2014, 2, 4)),
 (20, 'Hannah@gmail.com', datetime.date(2014, 2, 4))]

# Q-2. Write an SQL query to fetch duplicate records having matching data in some fields of a table.

In [19]:
cursor.execute("select department, count(*) from worker_table group by department having count(*)>1")

In [20]:
cursor.fetchall()

[('DSL', 5), ('Content', 8), ('Product', 4), ('Developer', 4)]

In [21]:
# let's check date of employee_email table.
cursor.execute("select joining_date, count(*) from employee_email group by joining_date having count(*)>1")

In [22]:
cursor.fetchall()

[(datetime.date(2014, 2, 2), 8),
 (datetime.date(2014, 2, 3), 6),
 (datetime.date(2014, 2, 4), 6)]

# Q-3. How to remove duplicate rows from Employees table.

In [49]:
#Let's create a table with duplicate records.
cursor.execute("create table organisation.employee1(emp_id INT(10), Name VARCHAR(20), Address VARCHAR(60), Salary INT(20), City VARCHAR(30))")

In [50]:
cursor.execute("insert into organisation.employee1 values(1, 'Sanchit', 'Ashokpuri', 950000, 'TamilNadu')")
cursor.execute("insert into organisation.employee1 values(2, 'Shilpa', 'ModelTown', 555000, 'Ranchi')")
cursor.execute("insert into organisation.employee1 values(3, 'Priyanka', 'Indrapuri', 550070, 'Goa')")
cursor.execute("insert into organisation.employee1 values(4, 'Sachin', 'janakpuri', 550000, 'Bombay')")
cursor.execute("insert into organisation.employee1 values(5, 'Sachin', 'janakpuri', 550000, 'Bombay')")
cursor.execute("insert into organisation.employee1 values(6, 'Swapnil', 'Royal colony', 650000, 'JHARKHAND')")
cursor.execute("insert into organisation.employee1 values(7, 'Ronak', 'janakpuri', 750000, 'Bihar')")
cursor.execute("insert into organisation.employee1 values(8, 'Anushka', 'Bommanhalli', 550000, 'Bengaluru')")
cursor.execute("insert into organisation.employee1 values(9, 'Swapnil', 'Royal colony', 650000, 'JHARKHAND')")
cursor.execute("insert into organisation.employee1 values(10, 'Swapnil', 'Royal colony', 650000, 'JHARKHAND')")

In [51]:
mydb.commit()

In [52]:
cursor.execute("show tables")

In [53]:
cursor.fetchall()

[('employee',), ('employee1',), ('employee_email',), ('worker_table',)]

In [54]:
import pandas as pd

In [55]:
pd.read_sql('select * from organisation.employee1',mydb)

   emp_id      Name       Address  Salary       City
0       1   Sanchit     Ashokpuri  950000  TamilNadu
1       2    Shilpa     ModelTown  555000     Ranchi
2       3  Priyanka     Indrapuri  550070        Goa
3       4    Sachin     janakpuri  550000     Bombay
4       5    Sachin     janakpuri  550000     Bombay
5       6   Swapnil  Royal colony  650000  JHARKHAND
6       7     Ronak     janakpuri  750000      Bihar
7       8   Anushka   Bommanhalli  550000  Bengaluru
8       9   Swapnil  Royal colony  650000  JHARKHAND
9      10   Swapnil  Royal colony  650000  JHARKHAND

In [60]:
cursor.execute("select name, address, count(*) from employee1 group by name, address having count(*)>1")

In [61]:
cursor.fetchall()

[('Sachin', 'janakpuri', 2), ('Swapnil', 'Royal colony', 3)]

In [72]:
cursor.execute(" delete from employee1 where emp_id=4")

In [73]:
mydb.commit()

In [74]:
import pandas as pd
pd.read_sql('select * from organisation.employee1',mydb)

   emp_id      Name       Address  Salary       City
0       1   Sanchit     Ashokpuri  950000  TamilNadu
1       2    Shilpa     ModelTown  555000     Ranchi
2       3  Priyanka     Indrapuri  550070        Goa
3       5    Sachin     janakpuri  550000     Bombay
4       6   Swapnil  Royal colony  650000  JHARKHAND
5       7     Ronak     janakpuri  750000      Bihar
6       8   Anushka   Bommanhalli  550000  Bengaluru
7       9   Swapnil  Royal colony  650000  JHARKHAND
8      10   Swapnil  Royal colony  650000  JHARKHAND

In [75]:
cursor.execute(" delete from employee1 where emp_id in (9,10)")

In [76]:
mydb.commit()

In [78]:
# now cross check.
cursor.execute("select name, address, count(*) from employee1 group by name, address having count(*)>1")

In [79]:
cursor.fetchall()

[]

                                      Keep Learning, Keep Growing...